In [11]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sn

## importing DataSet

In [12]:
too = pd.read_csv("toyota.csv",index_col=0,na_values=["??","???"])
tot = too.copy()
tot.head(2)

       year  price transmission  mileage fuelType  tax   mpg  engineSize
model
 GT86  2016  16000       Manual    24089   Petrol  265  36.2         2.0
 GT86  2017  15995       Manual    18615   Petrol  145  36.2         2.0

## Identifing missing Value
- for this, we use tow function
    - isnull
    - isna

In [13]:
tot.isnull().sum()

year            0
price           0
transmission    0
mileage         0
fuelType        0
tax             0
mpg             0
engineSize      0
dtype: int64

### No Missing Value

# add anohter DataSet

In [14]:
too = pd.read_csv("titanic_train.csv",index_col= 0,na_values=["??","???"])
tot = too.copy()
tot.head(2)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

### Check For Missing Value

In [15]:
tot.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

### how much Data We have

In [16]:
tot.count()

Survived    891
Pclass      891
Name        891
Sex         891
Age         714
SibSp       891
Parch       891
Ticket      891
Fare        891
Cabin       204
Embarked    889
dtype: int64

In [17]:
tot.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

## Age
- in the frist step I want to fill the age columns by mean of it data.

In [18]:
# finding the mean
tot["Age"].mean()

29.69911764705882

### Replace the Data
- we use the function namaly fillna